In [299]:
import psycopg2
import csv
import glob
import numpy as np 
from pandasql import sqldf
import pandas as pd
from scipy import stats

In [2]:
pysqldf = lambda q: sqldf(q, globals())

In [3]:
#create the database

# ! createdb mod2project

In [4]:
#connect to the database and make a cursor
conn = psycopg2.connect("dbname=mod2project")
cur = conn.cursor()

In [5]:
#set up our queries
create_query_1 = """
CREATE TABLE course_offerings(
  uuid text
, course_uuid text 
, term_code integer
, name text
)
"""

create_query_2 = """
CREATE TABLE courses(
  uuid text 
, name text 
, number integer
)
"""

create_query_3 = """
CREATE TABLE grade_distributions(
  course_offering_uuid text
, section_number text 
, a_count integer
, ab_count integer
, b_count integer
, bc_count integer
, c_count integer
, d_count integer
, f_count integer
, s_count integer
, u_count integer
, cr_count integer
, n_count integer
, p_count integer
, i_count integer
, nw_count integer
, nr_count integer
, other_count integer
)
"""

create_query_4 = """
CREATE TABLE instructors(
  id integer
, name text
)
"""

create_query_5 = """
CREATE TABLE rooms(
  uuid text
, facility_code text
, room_code text
)
"""

create_query_6 ="""
CREATE TABLE schedules(
  uuid text
, start_time integer
, end_time integer
, mon text
, tues text
, wed text
, thurs text
, fri text
, sat text
, sun text
)
"""

create_query_7 = """
CREATE TABLE sections(
  uuid text
, course_offering_uuid text
, section_type text
, number text
, room_uuid text
,schedule_uuid text
)
"""

create_query_8 = """
CREATE TABLE subject_memberships(
  subject_code integer
, course_offering_uuid text
)
"""

create_query_9 = """
CREATE TABLE subjects(
  code text
, name text
, abbreviation text
)
"""

create_query_10 = """
CREATE TABLE teachings(
  instructor_id integer
, section_uuid text
)
"""

In [6]:
#get the names and locations of our datafiles
csvs_for_table = glob.glob('raw_data/*.csv')

In [7]:
#make a list of our queries
queries_list = [create_query_1,create_query_2,create_query_3,create_query_4
               ,create_query_5,create_query_6,create_query_7
               ,create_query_8,create_query_9,create_query_10]

In [8]:
#extract table names from our file names
table_names = [x.split('/')[1][:-4] for x in csvs_for_table]

In [9]:
#loop through our queries list and execute them

# for query in queries_list:
#     cur.execute(query)
#     conn.commit()

In [10]:
# #loop through our table names and indexes
# for q_num, table_name in enumerate(table_names):
    
#     #extract values from our first queries to use
#     #in our insert statements below
#     fields = tuple(line.strip(", ").split()[0] for 
#                    line in queries_list[q_num].split('\n')[2:-2])
    
#     #set up our insert statements
#     query = f'''
#     INSERT INTO {table_name}
#     ({', '.join(fields)})
#     VALUES ({', '.join('%s' for _ in range(len(fields)))})
#     '''
        
    
#     #open each file and insert it's values row
#     #by row into the appropriate tables
#     with open(csvs_for_table[q_num], 'r') as file:
#         reader = csv.reader(file)
#         next(reader)  # Skip the header row.
#         for row in reader:
#             cur.execute(
#                 query,
#                 row
#             )
#             conn.commit()
            
#         #check where we're having problems
#         print(table_name,'still good')

In [11]:
# conn.rollback()

In [12]:
import sqlalchemy
from sqlalchemy import create_engine


engine = create_engine("postgresql:///mod2project", echo=True)

In [13]:
#this was a pain in many places
q = """

SELECT *,
    CASE
        WHEN term_code BETWEEN 1063 AND 1073 THEN '2006'
        WHEN term_code BETWEEN 1073 AND 1083 THEN '2007'
        WHEN term_code BETWEEN 1083 AND 1093 THEN '2008'
        WHEN term_code BETWEEN 1093 AND 1103 THEN '2009'
        WHEN term_code BETWEEN 1103 AND 1113 THEN '2010'
        WHEN term_code BETWEEN 1113 AND 1123 THEN '2011'
        WHEN term_code BETWEEN 1123 AND 1133 THEN '2012'
        WHEN term_code BETWEEN 1133 AND 1143 THEN '2013'
        WHEN term_code BETWEEN 1143 AND 1153 THEN '2014'
        WHEN term_code BETWEEN 1153 AND 1163 THEN '2015'
        WHEN term_code BETWEEN 1163 AND 1173 THEN '2016'
        WHEN term_code BETWEEN 1173 AND 1183 THEN '2017'
        ELSE 'the_world_is_over'
    END AS Year
    FROM course_offerings;
"""

In [14]:
year_df = pd.read_sql_query(q,con=engine)

2019-05-08 14:07:48,922 INFO sqlalchemy.engine.base.Engine select version()
2019-05-08 14:07:48,924 INFO sqlalchemy.engine.base.Engine {}
2019-05-08 14:07:48,928 INFO sqlalchemy.engine.base.Engine select current_schema()
2019-05-08 14:07:48,929 INFO sqlalchemy.engine.base.Engine {}
2019-05-08 14:07:48,934 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2019-05-08 14:07:48,935 INFO sqlalchemy.engine.base.Engine {}
2019-05-08 14:07:48,938 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2019-05-08 14:07:48,940 INFO sqlalchemy.engine.base.Engine {}
2019-05-08 14:07:48,941 INFO sqlalchemy.engine.base.Engine show standard_conforming_strings
2019-05-08 14:07:48,942 INFO sqlalchemy.engine.base.Engine {}
2019-05-08 14:07:48,945 INFO sqlalchemy.engine.base.Engine

SELECT *,
    CASE
        WHEN term_code BETWEEN 1063 AND 1073 THEN '2006'
        WHEN term_code BETWEEN 1073 AND 1083 THEN '2007'
        WHEN term_code BETWEEN 1083 AND 1093 THEN '2008'
        WHEN term_code BETWEEN 1093 AND 1103 THEN '2009'
        WHEN term_code BETWEEN 1103 AND 1113 THEN '2010'
        WHEN term_code BETWEEN 1113 AND 1123 THEN '2011'
        WHEN term_code BETWEEN 1123 AND 1133 THEN '2012'
        WHEN term_code BETWEEN 1133 AND 1143 THEN '2013'
        WHEN term_code BETWEEN 1143 AND 1153 THEN '2014'
        WHEN term_code BETWEEN 1153 AND 1163 THEN '2015'
        WHEN term_code BETWEEN 1163 AND 1173 THEN '2016'
        WHEN term_code BETWEEN 1173 AND 1183 THEN '2017'
        ELSE 'the_world_is_over'
    END AS Year
    FROM course_offerings;

2019-05-08 14:07:48,946 INFO sqlalchemy.engine.base.Engine {}

In [15]:
year_df.head()

,uuid,course_uuid,term_code,name,year
0,344b3ebe-da7e-314c-83ed-9425269695fd,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1092,Cooperative Education Prog,2008
1,f718e6cd-33f0-3c14-a9a6-834d9c3610a8,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1082,Cooperative Education Prog,2007
2,ea3b717c-d66b-30dc-8b37-964d9688295f,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1172,Cooperative Education Prog,2016
3,075da420-5f49-3dd0-93df-13e3c152e1b1,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1114,Cooperative Education Prog,2011
4,2b4e216d-a728-3713-8c7c-19afffc6b2fd,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1104,Cooperative Education Prog,2010

In [211]:
q = """
SELECT 
  sub_m.subject_code
, sub_j.name AS sub_j_name
, grade_d.a_count
, grade_d.ab_count
, grade_d.b_count
, grade_d.bc_count
, grade_d.c_count
,

  CASE
        WHEN term_code BETWEEN 1063 AND 1073 THEN '2006'
        WHEN term_code BETWEEN 1073 AND 1083 THEN '2007'
        WHEN term_code BETWEEN 1083 AND 1093 THEN '2008'
        WHEN term_code BETWEEN 1093 AND 1103 THEN '2009'
        WHEN term_code BETWEEN 1103 AND 1113 THEN '2010'
        WHEN term_code BETWEEN 1113 AND 1123 THEN '2011'
        WHEN term_code BETWEEN 1123 AND 1133 THEN '2012'
        WHEN term_code BETWEEN 1133 AND 1143 THEN '2013'
        WHEN term_code BETWEEN 1143 AND 1153 THEN '2014'
        WHEN term_code BETWEEN 1153 AND 1163 THEN '2015'
        WHEN term_code BETWEEN 1163 AND 1173 THEN '2016'
        WHEN term_code BETWEEN 1173 AND 1183 THEN '2017'
        ELSE 'the_world_is_over'
    END AS Year
    

FROM subject_memberships AS sub_m
JOIN subjects sub_j
ON cast(sub_m.subject_code as text) = cast(sub_j.code as text)
JOIN course_offerings cor_o
ON cor_o.uuid = sub_m.course_offering_uuid
JOIN grade_distributions grade_d
ON grade_d.course_offering_uuid = cor_o.uuid



"""

In [300]:
df_join = pd.read_sql_query(q,con=engine)

2019-05-08 16:08:35,258 INFO sqlalchemy.engine.base.Engine
SELECT
  sub_m.subject_code
, sub_j.name AS sub_j_name
, grade_d.a_count
, grade_d.ab_count
, grade_d.b_count
, grade_d.bc_count
, grade_d.c_count
,

  CASE
        WHEN term_code BETWEEN 1063 AND 1073 THEN '2006'
        WHEN term_code BETWEEN 1073 AND 1083 THEN '2007'
        WHEN term_code BETWEEN 1083 AND 1093 THEN '2008'
        WHEN term_code BETWEEN 1093 AND 1103 THEN '2009'
        WHEN term_code BETWEEN 1103 AND 1113 THEN '2010'
        WHEN term_code BETWEEN 1113 AND 1123 THEN '2011'
        WHEN term_code BETWEEN 1123 AND 1133 THEN '2012'
        WHEN term_code BETWEEN 1133 AND 1143 THEN '2013'
        WHEN term_code BETWEEN 1143 AND 1153 THEN '2014'
        WHEN term_code BETWEEN 1153 AND 1163 THEN '2015'
        WHEN term_code BETWEEN 1163 AND 1173 THEN '2016'
        WHEN term_code BETWEEN 1173 AND 1183 THEN '2017'
        ELSE 'the_world_is_over'
    END AS Year


FROM subject_memberships AS sub_m
JOIN subjects sub_j
ON cast(sub_m.subject_code as text) = cast(sub_j.code as text)
JOIN course_offerings cor_o
ON cor_o.uuid = sub_m.course_offering_uuid
JOIN grade_distributions grade_d
ON grade_d.course_offering_uuid = cor_o.uuid




2019-05-08 16:08:35,262 INFO sqlalchemy.engine.base.Engine {}

In [213]:
all_courses = set(df_join.sub_j_name)

In [214]:
humanities = {'African Languages and Literature', 'Afro-American Studies', 
              'American Indian Studies', 'Art Department', 'Anthropology'
              'Art Education (Department of Art)', 'Art History', 'Asian American Studies',
              'Chicana/o and Latina/o Studies', 'Classics', 'Collaborative Nursing Program',
              'Communication Arts','Communication Sciences and Disorders', 'Community and Environmental Sociology',
              'Comparative Literature', 'Consumer Science', 'Counseling Psychology', 'Curriculum and Instruction',
              'Dance', 'Design Studies', 'ENGLISH', 'East Asian Area Studies', 'East Asian Languages and Literature',
              'Economics', 'Educational Leadership and Policy Analysis', 'Educational Policy Studies',
              'Educational Psychology', 'Emergency Medicine', 'Engineering Professional Development',
              'English', 'English as a Second Language', 'Entomology', 'Environmental Studies - Gaylord Nelson Institute',
              'FAMILY AND CONSUMER COMMUNICATIONS', 'Family Medicine', 'Farm & Industry Short Course',
              'Finance, Investment and Banking', 'Folklore Program', 'Forest and Wildlife Ecology',
              'French (French and Italian)', 'Gender and Womenâ€™s Studies', 'General Business',
              'Geography', 'German', 'Greek (Classics)', 'HEBREW', 'Hebrew-Biblical', 'Hebrew-Modern',
              'History', 'History of Science', 'Horticulture', 'Human Development and Family Studies',
              'Human Oncology', 'INDUSTRIAL RELATIONS', 'Integrated Arts', 'Integrated Liberal Studies',
              'Integrated Science', 'Interdisciplinary Courses (CALS)', 'Interdisciplinary Courses (L&S)',
              'Interdisciplinary Courses (SOHE)', 'International Business', 'International Studies',
              'Italian (French and Italian)', 'Jewish Studies', 'Journalism and Mass Communication',
              'Kinesiology', 'La Follette School of Public Affairs',  'Landscape Architecture',
              'Languages and Cultures of Asia', 'Languages and Cultures of Asia - Languages',
              'Latin (Classics)', 'Latin American, Caribbean, and Iberian Studies',
              'Law','Legal Studies','Library and Information Studies',
              'Life Sciences Communication', 'Linguistics', 'Literature in Translation',
              'Management and Human Resources', 'Marketing', 'Medical History and Bioethics',
              'Medieval Studies','Music','Music-Performance','Nursing','Nutritional Sciences',
              'Occupational Therapy (Department of Kinesiology)',
              'Operations and Technology Management','PHYSICAL EDUC ACTIVITY PROGM',
              'PROFESSIONAL ORIENTATION', 'Pharmacy','Pharmacy Practice','Philosophy',
              'Physical Therapy','Physician Assistant Program','Political Science',
              'Portuguese (Spanish and Portuguese)','Psychiatry',
              'Real Estate and Urban Land Economics',
              'Rehabilitation Psychology and Special Education',
              'Religious Studies','Risk Management and Insurance',
              'Scandinavian Studies','Slavic (Slavic Languages)','Social Work',
              'Social and Administrative Pharmacy','Sociology','Soil Science',
              'Spanish (Spanish and Portuguese)','TRANSPORTATION AND PUBLIC UTILITIES',
              'Theatre and Drama','Therapeutic Science (Department of Kinesiology)',
              'Urban and Regional Planning','WILDLIFE ECOLOGY', 'Zoology'
 
              }

In [215]:
all_courses -= humanities

In [216]:
STEM = all_courses

In [217]:
len(STEM)

80

In [218]:
len(humanities)

114

In [219]:
df_join['weighted_a'] = df_join.a_count * 0.95

In [220]:
df_join['weighted_ab'] = df_join.ab_count * 0.9

In [221]:
df_join['weighted_b'] = df_join.b_count * 0.85

In [222]:
df_join['weighted_bc'] = df_join.bc_count * .8

In [223]:
df_join['weighted_c'] = df_join.c_count * .75

In [231]:
sum_grades = df_join.weighted_a + df_join.weighted_ab + df_join.weighted_b + df_join.weighted_bc + df_join.weighted_c


df_join['sum_of_grades'] = sum_grades

In [242]:
student_counts = df_join.a_count + df_join.ab_count + df_join.b_count + df_join.bc_count + df_join.c_count

df_join['student_count'] = student_counts

In [261]:
df_join['grade_ratio'] = df_join.sum_of_grades/ df_join.student_count

In [262]:
df_join.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211763 entries, 0 to 211762
Data columns (total 16 columns):
subject_code     211763 non-null int64
sub_j_name       211763 non-null object
a_count          211763 non-null int64
ab_count         211763 non-null int64
b_count          211763 non-null int64
bc_count         211763 non-null int64
c_count          211763 non-null int64
year             211763 non-null object
weighted_a       211763 non-null float64
weighted_ab      211763 non-null float64
weighted_b       211763 non-null float64
weighted_bc      211763 non-null float64
weighted_c       211763 non-null float64
sum_of_grades    211763 non-null float64
student_count    211763 non-null int64
grade_ratio      102325 non-null float64
dtypes: float64(7), int64(7), object(2)
memory usage: 25.9+ MB

In [263]:
df_STEM = df_join.loc[df_join.sub_j_name.isin(STEM)]

In [279]:
STEM_grade = df_STEM.grade_ratio.sum()/df_STEM.grade_ratio.count()

In [270]:
df_humanites = df_join.loc[df_join.sub_j_name.isin(humanities)]

In [280]:
humanites_grade = df_humanites.grade_ratio.sum()/df_humanites.grade_ratio.count()

In [301]:
df_STEM.head()

,subject_code,sub_j_name,a_count,ab_count,b_count,bc_count,c_count,year,weighted_a,weighted_ab,weighted_b,weighted_bc,weighted_c,sum_of_grades,student_count,grade_ratio
0,240,Civil and Environmental Engineering,105,1,0,0,0,2008,99.75,0.9,0.0,0.0,0.0,100.65,106,0.949528
1,490,Industrial and Systems Engineering,105,1,0,0,0,2008,99.75,0.9,0.0,0.0,0.0,100.65,106,0.949528
2,636,Materials Science and Engineering,105,1,0,0,0,2008,99.75,0.9,0.0,0.0,0.0,100.65,106,0.949528
3,207,Biomedical Engineering,105,1,0,0,0,2008,99.75,0.9,0.0,0.0,0.0,100.65,106,0.949528
4,612,Mechanical Engineering,105,1,0,0,0,2008,99.75,0.9,0.0,0.0,0.0,100.65,106,0.949528

In [302]:
df_humanites.head()

,subject_code,sub_j_name,a_count,ab_count,b_count,bc_count,c_count,year,weighted_a,weighted_ab,weighted_b,weighted_bc,weighted_c,sum_of_grades,student_count,grade_ratio
26,120,Life Sciences Communication,0,0,0,0,0,2014,0.0,0.0,0.00,0.0,0.0,0.00,0,NaN
40,741,Dance,38,2,0,0,0,2007,36.1,1.8,0.00,0.0,0.0,37.90,40,0.947500
41,741,Dance,18,1,0,0,0,2015,17.1,0.9,0.00,0.0,0.0,18.00,19,0.947368
42,741,Dance,22,3,5,0,0,2015,20.9,2.7,4.25,0.0,0.0,27.85,30,0.928333
43,741,Dance,18,12,0,0,0,2015,17.1,10.8,0.00,0.0,0.0,27.90,30,0.930000

In [281]:
STEM_grade - humanites_grade

-0.011691736796909269

In [288]:
STEM_mean = np.mean(df_STEM.grade_ratio)

In [303]:
STEM_mean

0.901916548339499

In [289]:
STEM_std = np.std(df_STEM.grade_ratio)

In [290]:
humanities_mean = np.mean(df_humanites.grade_ratio)

In [305]:
humanities_mean

0.9136082851364082

In [308]:
df_join

,subject_code,sub_j_name,a_count,ab_count,b_count,bc_count,c_count,year
0,240,Civil and Environmental Engineering,105,1,0,0,0,2008
1,490,Industrial and Systems Engineering,105,1,0,0,0,2008
2,636,Materials Science and Engineering,105,1,0,0,0,2008
3,207,Biomedical Engineering,105,1,0,0,0,2008
4,612,Mechanical Engineering,105,1,0,0,0,2008
5,346,Engineering Mechanics and Astronautics,105,1,0,0,0,2008
6,320,Electrical and Computer Engineering,105,1,0,0,0,2008
7,220,Chemical and Biological Engineering,105,1,0,0,0,2008
8,240,Civil and Environmental Engineering,129,8,2,0,1,2015
9,418,Geological Engineering,129,8,2,0,1,2015
10,490,Industrial and Systems Engineering,129,8,2,0,1,2015
11,636,Materials Science and Engineering,129,8,2,0,1,2015
12,207,Biomedical Engineering,129,8,2,0,1,2015
13,612,Mechanical Engineering,129,8,2,0,1,2015
14,346,Engineering Mechanics and Astronautics,129,8,2,0,1,2015
15,320,Electrical and Computer Engineering,129,8,2,0,1,2015
16,220,Chemical and Biological Engineering,129,8,2,0,1,2015
17,240,Civil and Environmental Engineering,114,3,1,0,2,2013
18,490,Industrial and Systems Engineering,114,3,1,0,2,2013
19,636,Materials Science and Engineering,114,3,1,0,2,2013
20,207,Biomedical Engineering,114,3,1,0,2,2013
21,612,Mechanical Engineering,114,3,1,0,2,2013
22,346,Engineering Mechanics and Astronautics,114,3,1,0,2,2013
23,684,Nuclear Engineering,114,3,1,0,2,2013
24,320,Electrical and Computer Engineering,114,3,1,0,2,2013
25,220,Chemical and Biological Engineering,114,3,1,0,2,2013
26,120,Life Sciences Communication,0,0,0,0,0,2014
27,112,Biological Systems Engineering,0,0,0,0,0,2013
28,112,Biological Systems Engineering,0,0,0,0,0,2013
29,112,Biological Systems Engineering,0,0,0,0,0,2013
...,...,...,...,...,...,...,...,...
211733,682,Neuroscience Training Program,26,1,0,0,0,2017
211734,412,Genetics,17,13,0,0,0,2017
211735,681,Neuroscience,8,2,0,0,0,2017
211736,820,Psychology,8,2,0,0,0,2017
211737,970,Zoology,8,2,0,0,0,2017
211738,247,Civil Society and Community Studies,8,2,0,0,0,2017
211739,810,Population Health Sciences,0,0,0,0,0,2017
211740,728,Pharmacy Practice,19,1,0,0,0,2017
211741,728,Pharmacy Practice,12,0,0,0,0,2017
211742,108,Agricultural and Applied Economics,9,5,3,3,0,2017
211743,416,Geography,0,0,0,0,0,2017
211744,348,Engineering Professional Development,18,0,0,0,0,2017
211745,236,Management and Human Resources,18,0,0,0,0,2017
211746,231,General Business,18,0,0,0,0,2017
211747,778,Political Science,0,0,0,0,0,2017
211748,498,Interdisciplinary Courses (SOHE),11,0,0,0,0,2017
211749,498,Interdisciplinary Courses (SOHE),11,0,0,0,0,2017
211750,498,Interdisciplinary Courses (SOHE),9,0,0,0,0,2017
211751,498,Interdisciplinary Courses (SOHE),8,0,0,0,0,2017
211752,604,Animal Sciences,10,0,1,0,0,2017
211753,810,Population Health Sciences,10,0,1,0,0,2017
211754,412,Genetics,10,0,1,0,0,2017
211755,305,Educational Leadership and Policy Analysis,20,0,0,0,0,2017
211756,305,Educational Leadership and Policy Analysis,17,4,0,0,0,2017
211757,622,Medical Sciences - Medical School,0,0,0,0,0,2017
211758,622,Medical Sciences - Medical School,0,0,0,0,0,2017
211759,622,Medical Sciences - Medical School,0,0,0,0,0,2017
211760,622,Medical Sciences - Medical School,0,0,0,0,0,2017
211761,622,Medical Sciences - Medical School,0,0,0,0,0,2017
211762,936,Surgery,0,0,0,0,0,2017

In [306]:
STEM_mean - humanities_mean

-0.011691736796909269

In [292]:
z_score = (humanities_mean - STEM_mean)/ STEM_std

In [293]:
z_score

0.3252704290914449

In [298]:
stats.norm.sf(z_score)

0.37248820461361276

In [267]:
df_humanites.head()

,subject_code,sub_j_name,a_count,ab_count,b_count,bc_count,c_count,year,weighted_a,weighted_ab,weighted_b,weighted_bc,weighted_c,sum_of_grades,student_count,grade_ratio
26,120,Life Sciences Communication,0,0,0,0,0,2014,0.0,0.0,0.00,0.0,0.0,0.00,0,NaN
40,741,Dance,38,2,0,0,0,2007,36.1,1.8,0.00,0.0,0.0,37.90,40,0.947500
41,741,Dance,18,1,0,0,0,2015,17.1,0.9,0.00,0.0,0.0,18.00,19,0.947368
42,741,Dance,22,3,5,0,0,2015,20.9,2.7,4.25,0.0,0.0,27.85,30,0.928333
43,741,Dance,18,12,0,0,0,2015,17.1,10.8,0.00,0.0,0.0,27.90,30,0.930000

In [268]:
df_join.a_count.unique()

array([105, 129, 114,   0,  38,  18,  22,  23,  14,  15,  46,  44,  11,
        21,  35,  16,  24,   5,   7,   8,   6,   3,  37,  43,  34,  32,
        33,  36,  58,  55,  53, 300, 304, 295, 259, 111,  88,  95, 126,
        83, 106,  57,  54,  78,  90,  39,  84,  81,  28,  25,  26,  20,
        13,  40,  63,  29,  50,  52,  56,   9,  62,  74,  73,  65,  45,
       132, 113,  92, 110, 104,  27,  10,  60,  70,   4,   2,   1,  12,
        17,  19,  30,  59,  31,  48,  85,  66,  69,  42,  67,  64,  94,
        76,  86,  75,  80,  47,  71,  79,  49,  68, 121,  72, 180, 119,
        41,  77, 103,  91,  61,  97, 101,  93,  89,  98, 235, 188, 123,
       136, 209, 194, 237, 107, 102, 131, 162, 167, 170, 122, 183, 204,
       124, 120, 117,  51,  87, 421, 517, 694, 278, 150, 347, 211, 169,
       292, 192, 137, 127, 214, 157, 197, 141,  99, 100, 153, 158, 159,
       116, 221, 138, 118,  82, 152, 146, 128, 143, 130, 135, 112, 165,
       164, 147, 115, 109, 148, 178, 166, 133, 149, 219,  96, 108, 175,
       213, 125, 244, 139, 154, 134, 172, 171, 145, 144, 184, 266, 311,
       315, 253, 301, 160, 217, 198, 173, 236, 168, 228, 177, 193, 155,
       674, 678, 559, 461, 247, 156, 191, 176, 185, 359, 276, 140, 142,
       257, 151, 201, 163, 215, 324, 252, 306, 262, 254, 208, 196, 203,
       216, 199, 456, 602, 582, 547, 531, 572, 200, 207, 187, 212, 239,
       179, 181, 174, 412, 261, 280, 319, 688, 704, 534, 601, 414, 576,
       510, 701, 598, 612, 618, 512, 498, 242, 161, 195, 189, 225, 220])